Tekla Open API Reference for Tekla Structures 2025
EnumConverter Methods
The EnumConverter type exposes the following members.
Methods
Name | Description
CanConvertFrom |  (Overrides TypeConverter.CanConvertFrom(ITypeDescriptorContext, Type).)
CanConvertTo |  (Overrides TypeConverter.CanConvertTo(ITypeDescriptorContext, Type).)
ConvertFrom |  (Overrides TypeConverter.ConvertFrom(ITypeDescriptorContext, CultureInfo, Object).)
ConvertTo |  (Overrides TypeConverter.ConvertTo(ITypeDescriptorContext, CultureInfo, Object, Type).)
Top
See Also
Reference
EnumConverter Class
Tekla.Structures.Datatype Namespace